Table of Contents
 Class Span
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Span allows specifying haunched member.
Both cross-section must be of the same type. Spans must not overlap.
[OpenModelClass("CI.StructModel.Structure.Span,CI.StructuralElements", "CI.StructModel.Structure.ISpan,CI.BasicTypes")]
public class Span : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Span
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndCrossSection
Cross-section at the end position of the span.
public ReferenceElement EndCrossSection { get; set; }
Property Value
ReferenceElement
 EndPosition
Relative position on the member where the span ends.
public double EndPosition { get; set; }
Property Value
double
 StartCrossSection
Cross-section at the start position of the span. Must not be null.
public ReferenceElement StartCrossSection { get; set; }
Property Value
ReferenceElement
 StartPosition
Relative position on the member where the span starts.
public double StartPosition { get; set; }
Property Value
double
 Edit this page